475241512/BT_Printer/资料/NUC123_USB_Printer_V1.01.00/NUC123_USB_Printer_V1.01.00/LIB_Source/Nuc123_usb_1.c
//=======================================================================================
//  Copyright Nuvoton(Shang-Hai) Technology Corp. All rights reserved. 2014 
//=======================================================================================
#define   USB_GLOBAL
#include  "NUC123Series.h"
#include  "printer.h"
#include  "Nuc123_usb_1.h" 

extern  void  USB_Tx_OVER(void) ;                //相当于发送结束中断函数
extern  void  USB_Rx_Data(void) ;                //相当于接收到数据中断函数
extern  void  PTR_Data_Receive(void) ;              

#define  GET_STATUS                0x00                    //USB协议定义的11种标准请求
#define  CLEAR_FEATURE             0x01
#define  SET_FEATURE               0x03
#define  SET_ADDRESS               0x05
#define  GET_DESCRIPTOR            0x06
#define  SET_DESCRIPTOR            0x07
#define  GET_CONFIGURATION         0x08
#define  SET_CONFIGURATION         0x09
#define  GET_INTERFACE             0x0A
#define  SET_INTERFACE             0x0B
#define  SYNC_FRAME                0x0C

#define  DESC_DEVICE               0x01                    //USB协议定义的几种描述符请求
#define  DESC_CONFIG               0x02
#define  DESC_STRING               0x03
#define  DESC_INTERFACE            0x04
#define  DESC_ENDPOINT             0x05
#define  DESC_QUALIFIER            0x06
#define  DESC_OTHERSPEED           0x07

#define  LEN_DEVICE                18                      //USB协议定义的设备描述符长度
#define  LEN_CONFIG                9                       //USB协议定义的配置描述符长度
#define	 LEN_INTERFACE             9                       //USB协议定义的接口描述符长度
#define	 LEN_ENDPOINT              7                       //USB协议定义的端点描述符长度

#define  EP_BULK                   0x02                    //此四个是USB协议中定义的端点属性值
#define  EP_INT                    0x03
#define  EP_INPUT                  0x80
#define  EP_OUTPUT                 0x00
 
#define  FLAG_SET_LINE_CODE        0x0200                  // CDC Class 
#define  DESC_HID                  0x21                    // USB HID Descriptor Type 
#define  DESC_HID_RPT              0x22                    // USB HID Descriptor Type 

#define  SEND_ENCAPSULATED_COMMAND 0x00                    // CDC Class Specific Request 
#define  GET_ENCAPSULATED_RESPONSE 0x01
#define  SET_COMM_FEATURE          0x02
#define  GET_COMM_FEATURE          0x03
#define  CLEAR_COMM_FEATURE        0x04
#define  SET_LINE_CODE             0x20
#define  GET_LINE_CODE             0x21
#define  SET_CONTROL_LINE_STATE    0x22
#define  SEND_BREAK                0x23
                                                           //用于写端点配置 CFG 的位定义
#define  USB_OUT_ENDP              0x20                    //输出端点
#define  USB_ISOCH_OUT_ENDP        0x30                    //等时输出端点
#define  USB_IN_ENDP               0x40                    //输入端点     
#define  USB_ISOCH_IN_ENDP         0x50                    //等时输入端点

#define  USB_PACKET_SIZE_MAX       64                      // 最大USB包大小  
#define  USB_CFG_DSQ_SYNC_DATA1    0x0080                  // 数据序列 DATA1

#define  BULK_IN_EP_NUM            1                       //用到的三个端点地址
#define  BULK_OUT_EP_NUM           2
#define  INT_IN_EP_NUM             3 

#ifdef PRINTER_USB_VCOM    ////=========================================// 虚拟串口描述符

#define  USB_VID		           0x0416
#define  USB_PID		           0x5011
const uint8_t USB_DeviceDescriptor[] =
{
	LEN_DEVICE,		/* bLength              */
	DESC_DEVICE,	/* bDescriptorType      */
	0x00, 0x02,		/* bcdUSB               */                 // USB版本
	0x02,			/* bDeviceClass         */                     // 设备类
	0x00,			/* bDeviceSubClass      */
	0x00,			/* bDeviceProtocol      */
	USB_PACKET_SIZE_MAX,	/* bMaxPacketSize0 */              // 端点0最大包
	/* idVendor */
	USB_VID & 0x00FF,                                        // 厂商编号
	(USB_VID & 0xFF00) >> 8,
	/* idProduct */
	USB_PID & 0x00FF,                                        // 产品编号
	(USB_PID & 0xFF00) >> 8,
	0x00, 0x03,		/* bcdDevice            */                 // 设备编号
	0x01,			/* iManufacture         */                     // 厂商串索引
	0x02,			/* iProduct             */                     // 产品串索引
	0x00,			/* iSerialNumber        */                     // 序列号串索引
	0x01			/* bNumConfigurations   */
};
const uint8_t USB_ConfigDescriptor[] =
{
	LEN_CONFIG,		/* bLength              */
	DESC_CONFIG,	/* bDescriptorType      */
	0x43, 0x00,		/* wTotalLength         */                 //配置描述符总长度
	0x02,			/* bNumInterfaces       */
	0x01,			/* bConfigurationValue  */
	0x00,			/* iConfiguration       */
	0xC0,			/* bmAttributes         */
	0x32,			/* MaxPower             */

	/* INTERFACE descriptor */
	LEN_INTERFACE,	/* bLength              */
	DESC_INTERFACE,	/* bDescriptorType      */
	0x00,			/* bInterfaceNumber     */
	0x00,			/* bAlternateSetting    */
	0x01,			/* bNumEndpoints        */
	0x02,			/* bInterfaceClass      */                     // CDC control class
	0x02,			/* bInterfaceSubClass   */
	0x01,			/* bInterfaceProtocol   */
	0x01,			/* iInterface           */

	/* Communication Class Specified INTERFACE descriptor */
    0x05,           /* Size of the descriptor, in bytes */
    0x24,           /* CS_INTERFACE descriptor type */
    0x00,           /* Header functional descriptor subtype */
    0x10, 0x01,     /* Communication device compliant to the communication spec. ver. 1.10 */
    
	/* Communication Class Specified INTERFACE descriptor */
    0x05,           /* Size of the descriptor, in bytes */
    0x24,           /* CS_INTERFACE descriptor type */
    0x01,           /* Call management functional descriptor */
    0x00,           /* BIT0: Whether device handle call management itself. */
                    /* BIT1: Whether device can send/receive call management information over a Data Class Interface 0 */
    0x01,           /* Interface number of data class interface optionally used for call management */

	/* Communication Class Specified INTERFACE descriptor */
    0x04,           /* Size of the descriptor, in bytes */
    0x24,           /* CS_INTERFACE descriptor type */
    0x02,           /* Abstract control management funcational descriptor subtype */
    0x00,           /* bmCapabilities       */
    
	/* Communication Class Specified INTERFACE descriptor */
    0x05,           /* bLength              */
    0x24,           /* bDescriptorType: CS_INTERFACE descriptor type */
    0x06,           /* bDescriptorSubType   */
    0x00,           /* bMasterInterface     */
    0x01,           /* bSlaveInterface0     */
    
	/* ENDPOINT descriptor */
	LEN_ENDPOINT,	                /* bLength          */
	DESC_ENDPOINT,	                /* bDescriptorType  */
	(EP_INPUT | INT_IN_EP_NUM),     /* bEndpointAddress */   //端点地址:3,中断IN
	EP_INT,		                    /* bmAttributes     */
	USB_PACKET_SIZE_MAX, 0x00,	    /* wMaxPacketSize   */
	0x01,	                        /* bInterval        */     //间隔 1ms
			
