475241512/BT_Printer/资料/NUC123_USB_Printer_V1.01.00/NUC123_USB_Printer_V1.01.00/LIB_Source/Nuc123_usb_1.c
	/* INTERFACE descriptor */
	LEN_INTERFACE,	/* bLength              */
	DESC_INTERFACE,	/* bDescriptorType      */
	0x01,			/* bInterfaceNumber     */
	0x00,			/* bAlternateSetting    */
	0x02,			/* bNumEndpoints        */
	0x0A,			/* bInterfaceClass      */                     // CDC data
	0x00,			/* bInterfaceSubClass   */
	0x00,			/* bInterfaceProtocol   */
	0x01,			/* iInterface           */
			
	/* ENDPOINT descriptor */
	LEN_ENDPOINT,	                /* bLength          */
	DESC_ENDPOINT,	                /* bDescriptorType  */
	(EP_INPUT | BULK_IN_EP_NUM),	/* bEndpointAddress */     //端点地址:1, Bulk in
	EP_BULK,		                /* bmAttributes     */
	USB_PACKET_SIZE_MAX, 0x00,	    /* wMaxPacketSize   */
	0x00,			                /* bInterval        */

	/* ENDPOINT descriptor */
	LEN_ENDPOINT,	                /* bLength          */
	DESC_ENDPOINT,	                /* bDescriptorType  */
	(EP_OUTPUT | BULK_OUT_EP_NUM),	/* bEndpointAddress */   //端点地址:2, Bulk out
	EP_BULK,		                /* bmAttributes     */
	USB_PACKET_SIZE_MAX, 0x00,     /* wMaxPacketSize   */
	0x00,			                /* bInterval        */
};
const uint8_t USB_ProductStringDesc[] =
{
	32,             /* bLength          */
	DESC_STRING,    /* bDescriptorType  */
	'U', 0, 
  'S', 0,	
  'B', 0,	
  ' ', 0,	
  'V', 0,	
  'i', 0,	
  'r', 0,	
  't', 0,	
  'u', 0,	
  'a', 0,
	'l', 0,	
	' ', 0,	
  'C', 0,	
  'O', 0,	
  'M', 0
};

#else     ////=============================================// 打印机描述符 ==============
#define  USB_VID		           0x0416
#define  USB_PID		           0xAABB
const uint8_t USB_DeviceDescriptor[] =
{
	LEN_DEVICE,		/* bLength              */
	DESC_DEVICE,	/* bDescriptorType      */
	0x10, 0x01,		/* bcdUSB               */
	0x00,			/* bDeviceClass         */
	0x00,			/* bDeviceSubClass      */
	0x00,			/* bDeviceProtocol      */
	USB_PACKET_SIZE_MAX,	/* bMaxPacketSize0 */
	/* idVendor */
	USB_VID & 0x00FF,
	(USB_VID & 0xFF00) >> 8,
	/* idProduct */
	USB_PID & 0x00FF,
	(USB_PID & 0xFF00) >> 8,
	0x00, 0x00,		/* bcdDevice            */
	0x01,			/* iManufacture         */
	0x02,			/* iProduct             */
	0x00,			/* iSerialNumber        */
	0x01			/* bNumConfigurations   */              
};
const uint8_t USB_ConfigDescriptor[] =
{
	LEN_CONFIG,		// bLength
	DESC_CONFIG,	// bDescriptorType
	// wTotalLength
	0x4E,	0x00,
	0x01,			// bNumInterfaces
	0x01,			// bConfigurationValue
	0x00,			// iConfiguration
  0xA0,
  50,       // MaxPower 2*50mA

	// I/F descr: Printer class
	LEN_INTERFACE,	// bLength
	DESC_INTERFACE,	// bDescriptorType
	0x00,			// bInterfaceNumber
	0x00,			// bAlternateSetting
	0x01,			// bNumEndpoints
	0x07,			// bInterfaceClass                             // Printer class
	0x01,			// bInterfaceSubClass
	0x01,			// bInterfaceProtocol
	0x00,			// iInterface                                  // string index

	// EP Descriptor: Bulk Out
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(BULK_OUT_EP_NUM | EP_OUTPUT),	// bEndpointAddress
	EP_BULK,		// bmAttributes
	// wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x00,		// bInterval

	// I/F descr: Printer class
	LEN_INTERFACE,	// bLength
	DESC_INTERFACE,	// bDescriptorType
	0x00,			// bInterfaceNumber
	0x01,			// bAlternateSetting
	0x02,			// bNumEndpoints
	0x07,			// bInterfaceClass
	0x01,			// bInterfaceSubClass
	0x02,			// bInterfaceProtocol
	0x00,			// iInterface

	// EP Descriptor: Bulk Out
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(BULK_OUT_EP_NUM | EP_OUTPUT),	// bEndpointAddress
	EP_BULK,		// bmAttributes
	// wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x00,		// bInterval

	// EP Descriptor: Bulk In
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(BULK_IN_EP_NUM | EP_INPUT),	// bEndpointAddress
	EP_BULK,		// bmAttributes
	// wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x00,		// bInterval

	// I/F descr: Printer class
	LEN_INTERFACE,	// bLength
	DESC_INTERFACE,	// bDescriptorType
	0x00,			// bInterfaceNumber
	0x02,			// bAlternateSetting
	0x03,			// bNumEndpoints
	0xFF,			// bInterfaceClass
	0x00,			// bInterfaceSubClass
	0xFF,			// bInterfaceProtocol
	0x00,			// iInterface

	// EP Descriptor: Bulk Out
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(BULK_OUT_EP_NUM | EP_OUTPUT),	// bEndpointAddress
	EP_BULK,		// bmAttributes
	// wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x00,		// bInterval

	// EP Descriptor: Bulk In
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(BULK_IN_EP_NUM | EP_INPUT),	// bEndpointAddress
	EP_BULK,		// bmAttributes
	// wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x00,		// bInterval

	// EP Descriptor: Interrupt In
	LEN_ENDPOINT,	// bLength
	DESC_ENDPOINT,	// bDescriptorType
	(INT_IN_EP_NUM | EP_INPUT),	// bEndpointAddress
	EP_INT,		// bmAttributes
	                                  // wMaxPacketSize
	USB_PACKET_SIZE_MAX & 0x00FF,
	(USB_PACKET_SIZE_MAX & 0xFF00) >> 8,
	0x01		// bInterval
};
const uint8_t USB_ProductStringDesc[] =
{
	54,
	DESC_STRING,
	  'N', 0,
    'u', 0,
    'v', 0,
    'o', 0,
    't', 0,
    'o', 0,
    'n', 0,
    ' ', 0,
    'U', 0,
    'S', 0,
    'B', 0,
    ' ', 0,
    'P', 0,
    'r', 0,
    'i', 0,
    'n', 0,
    't', 0,
    'e', 0,
    'r', 0,
    '_', 0,
    'N', 0,
    'U', 0,
    'C', 0,
    '1', 0,
    '2', 0,
    '3', 0,
};

#endif    ////===========================================================================

//如果不支持字符串请求,这些字符串就可以不定义,节省代码空间
const uint8_t USB_StringLang[4] =                          // 语言类
{
	4,				/* bLength */
	DESC_STRING,	/* bDescriptorType */
	0x09, 0x04                                  
};

const uint8_t USB_VendorStringDesc[] =
{
	16,
	DESC_STRING,
	'N', 0, 
  'u', 0, 
  'v', 0, 
  'o', 0, 
  't', 0, 
  'o', 0, 
  'n', 0
};


#define  Maximum(a,b)              (a)>(b) ? (a) : (b)
#define  Minimum(a,b)              (a)<(b) ? (a) : (b)

//这两个指针宏定义，注意要和初始化SRAM缓存的地址一致    
#define  pSetUp              ((uint8_t*)USB_SRAM)          //SETUP数据放在SRAM 0
#define  pEnd0Data           ((uint8_t*)(USB_SRAM+8))      //端点0/1数据放在SRAM 8

//// USB 初始化 =========================================================================
void USB_Init(void)
{
  uint32_t volatile temp  = 900 ;
 
  CLK->APBCLK  |=  CLK_APBCLK_USBD_EN_Msk ;                // Enable USB Clock
  SYS->IPRSTC2 |=  (1ul << 27) ;                           // Reset USB 
  SYS->IPRSTC2 &= ~(1ul << 27) ;

