475241512/BT_Printer/资料/NUC123_USB_Printer_V1.01.00/NUC123_USB_Printer_V1.01.00/LIB_Source/Nuc123_usb_1.c
  USBD->ATTR |= USBD_ATTR_BYTEMODE ;
  USBD->DRVSE0 = 1 ;	
  while(temp--) ;   
  
  USBD->STBUFSEG  = 0 ;                                           //Setup的8个字节存放首址                           
  USBD->EP[0].BUFSEG = 8 ;				                                //数据首址
  USBD->EP[0].CFG    = (USBD_EPCFG_CLEARSTALL | USB_IN_ENDP) ;    //端点地址:0
  USBD->EP[1].BUFSEG = 8 ;				                  
  USBD->EP[1].CFG    = (USBD_EPCFG_CLEARSTALL | USB_OUT_ENDP) ;   //端点地址都为0,且共用一个数据区

  USBD->EP[2].BUFSEG = 8+64 ;				                                            //数据首址
  USBD->EP[2].CFG    = (USBD_EPCFG_CLEARSTALL | USB_IN_ENDP | BULK_IN_EP_NUM);  //端点地址:1,BULK_IN_EP_NUM
  USBD->EP[3].BUFSEG = 8+64+64 ;                                                //数据首址
  USBD->EP[3].CFG    = (USBD_EPCFG_CLEARSTALL | USB_OUT_ENDP | BULK_OUT_EP_NUM);//端点地址:2,BULK_OUT_EP_NUM
  USBD->EP[4].BUFSEG = 8+64+64+64 ;                                             //数据首址
  USBD->EP[4].CFG    = (USBD_EPCFG_CLEARSTALL | USB_IN_ENDP | INT_IN_EP_NUM) ;  //端点地址:3,INT_IN_EP_NUM

  USBD->INTEN = USBD_WAKUP_IE_ENABLE | USBD_INT_FLDET | USBD_INT_USB | USBD_INT_BUS ;
  NVIC_SetPriority(USBD_IRQn, 2) ;                                   // 中断优先级为 2, 低于走纸电机中断
  NVIC->ISER[0] = 1 << USBD_IRQn ;                                   // 打开中断向量
  USBD->DRVSE0 = 0 ;
  Vcom_TxSize  = 0 ;                                                 //标示没有数据要发送

  PDMA2->SAR  = USBD->EP[3].BUFSEG ;                       // 源地址: EP[3]的 RAM
  PDMA2->CSR  = 0x00000025 +(1 << 19) ;                    // 8位,源固定,目的加,IP->MEM  
  PDMA2->CSR |=  2 ;                                       // 复位 PDMA0
}

void USB_CtrlOut_Ack(void)
{
  switch(gUsbCtrl.StateFlag){                                    
    case FLAG_SET_LINE_CODE :
//      if(gUsbInfo.UsbDeviceClass & USB_CLASS_CDC){
//        MultiByte_copy((void *)&gCdcInfo,(uint8_t*)(USBD_SRAM_BASE+USBD->BUFSEG0),USBD->MXPLD1);
//        USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1 ;
//        USBD->MXPLD0 = 0 ;                                 //状态阶段准备
//      }
      break ;

    case 0 :                       //状态阶段OUT_ACK数据上传无错,若出错主机会发起重传
    default :
      break ;
  }
  gUsbCtrl.StateFlag = 0;
}

// 端点0的Ctrl_IN数据,即控制传输的状态阶段 ==============================================
void USB_CtrlIn_Ack(void)
{
  uint32_t  Cnt ;

  switch (gUsbCtrl.StateFlag){
    case FLAG_EP0_DATA_IN :                                //上次数据事务满包
      if(gUsbCtrl.ReqLen){
        Cnt = 0 ;
        do{
          pEnd0Data[Cnt] = *gUsbCtrl.pDesc++ ;
          if(++Cnt >= USB_PACKET_SIZE_MAX) break ;
        }while(--gUsbCtrl.ReqLen) ;
        USBD->EP[0].MXPLD = Cnt ;
      }
      else{                                                // 数据已全部上传
        USBD->EP[0].MXPLD  = 0 ;
        USBD->EP[1].MXPLD  = 0 ;                           // 启动状态阶段
        gUsbCtrl.StateFlag = 0 ;                           // 状态结束后,不做处理 
      }	
      return ;
                                                           //以下是状态阶段的 IN_ACK 
    case FLAG_SET_ADDRESS :                                //配置地址过程结束
        USBD->FADDR = pSetUp[2];                           //这里省去了StatusFlag清零
    default:
        return;    
  }
}

//// 类请求功能, 为简化代码,这个功能可以不支持 ==========================================
#define  GET_DEVICE_ID             0x00
#define  GET_PORT_STATUS           0x01
#define  SOFT_RESET                0x02
uint16_t gVCOMStatus ;    
void USB_ClassRequest(void)
{
  switch(pSetUp[1]){
    case GET_LINE_CODE :
      pEnd0Data[0] = (char)115200 ;         pEnd0Data[1] = (char)(115200 >> 8) ; 
      pEnd0Data[2] = (char)(115200 >> 16) ; pEnd0Data[3] = (char)(115200 >> 24) ; 
      pEnd0Data[4] = 0 ;                                   // 1-stop
      pEnd0Data[5] = 0 ;                                   // No parity
      pEnd0Data[6] = 8 ;                                   // 8bit
      USBD->EP[0].CFG  |= 0x80 ;   
      USBD->EP[0].MXPLD = 7 ;                  
    
      USBD->EP[1].MXPLD = 0 ;                              // 状态阶段的OUT准备
      break ;
    
    case SET_LINE_CODE :                                  
      USBD->EP[1].MXPLD = 7 ;                              // Out波特率等数据丢掉 
    
      USBD->EP[0].CFG  |= 0x80;   
      USBD->EP[0].MXPLD = 0;                               // 状态阶段准备
      break ;
    
    case SET_CONTROL_LINE_STATE : 
      gVCOMStatus = ((uint16_t)pSetUp[3]) + pSetUp[2] ;  
    
      USBD->EP[0].CFG  |= 0x80;   
      USBD->EP[0].MXPLD = 0;                               // 状态阶段准备
      break ;
    
//     case GET_PORT_STATUS :                                 // In PtrStatus
//       USBD->EP[0].CFG  |= USB_CFG_DSQ_SYNC_DATA1 ;
//       USBD->EP[0].MXPLD = 0 ;                              //状态阶段准备
//       break ;
    default :
    USBD->EP[0].CFGP |= 2 ;                                //功能不支持,回STALL
    USBD->EP[1].CFGP |= 2 ;
  }
}

/// 几种描述符请求, 为简化代码, 取消了字符串请求功能 ====================================
void USB_GetDescriptor(void)
{
  uint32_t Cnt ;
  uint8_t *ptr ;

  gUsbCtrl.ReqLen = pSetUp[6] + ((uint32_t)pSetUp[7]<<8);  //传输长度
  USBD->EP[0].CFG |= 0x80;                                 //之前是SETUP,此位不会Toggle
  gUsbCtrl.StateFlag = 0 ;             //先假定函数结束后是状态阶段,且状态过后什么也不做
            
  switch(pSetUp[3]){                                       //这个字节决定是什么描述符
    case DESC_DEVICE:                                      //设备描述符, 18字节
      ptr = (uint8_t*)USB_DeviceDescriptor ;
      Cnt = 0 ;
      do{
        pEnd0Data[Cnt] = *ptr++ ;
      }while(++Cnt <= 18);                                 //设备描述符18个字节
      USBD->EP[0].MXPLD = 18 ;
      break;
	 
    case DESC_CONFIG:                            //配置描述符, 长度不定, 此67个字节
      gUsbCtrl.ReqLen = Minimum (gUsbCtrl.ReqLen, (USB_ConfigDescriptor[3]<<8)|USB_ConfigDescriptor[2]);
      ptr = (uint8_t*)USB_ConfigDescriptor ;
      Cnt = 0 ;
      if(gUsbCtrl.ReqLen  >= USB_PACKET_SIZE_MAX){	
        do{pEnd0Data[Cnt]  = *ptr++ ;}while(++Cnt <= USB_PACKET_SIZE_MAX) ;
        USBD->EP[0].MXPLD  = USB_PACKET_SIZE_MAX;
        gUsbCtrl.pDesc     = (uint8_t *)USB_ConfigDescriptor + USB_PACKET_SIZE_MAX ;
        gUsbCtrl.ReqLen   -= USB_PACKET_SIZE_MAX;
        gUsbCtrl.StateFlag = FLAG_EP0_DATA_IN;
      }
      else{
        while(Cnt < gUsbCtrl.ReqLen){ pEnd0Data[Cnt] = *ptr++ ; ++Cnt;}
        USBD->EP[0].MXPLD  = Cnt;
        USBD->EP[1].MXPLD  = 0 ;                           // 状态阶段准备
      }
      break;

   case DESC_STRING:                                       //串描述符
     Cnt = 0 ;
     if(pSetUp[2] == 0){                                   // 语言类
       gUsbCtrl.ReqLen = Minimum (gUsbCtrl.ReqLen, USB_StringLang[0]);
       ptr = (uint8_t*)USB_StringLang ;
       do{
         pEnd0Data[Cnt] = *ptr++ ;
       }while(++Cnt <= gUsbCtrl.ReqLen);
       USBD->EP[0].MXPLD = gUsbCtrl.ReqLen;
       break;
     }
//      else if(pSetUp[2] == 1){                              // 供应商
//        gUsbCtrl.ReqLen = Minimum (gUsbCtrl.ReqLen, USB_VendorStringDesc[0]);
//        ptr = (uint8_t*)USB_VendorStringDesc ;
//        Cnt = 0 ;
//        if(gUsbCtrl.ReqLen  >= USB_PACKET_SIZE_MAX){	
//          do{pEnd0Data[Cnt]  = *ptr++ ;}while(++Cnt <= USB_PACKET_SIZE_MAX) ;
//          USBD->EP[0].MXPLD  = USB_PACKET_SIZE_MAX;
//          gUsbCtrl.pDesc     = (uint8_t *)USB_ConfigDescriptor + USB_PACKET_SIZE_MAX ;
//          gUsbCtrl.ReqLen   -= USB_PACKET_SIZE_MAX;
//          gUsbCtrl.StateFlag = FLAG_EP0_DATA_IN;
//        }
//        else{
//          while(Cnt < gUsbCtrl.ReqLen){ pEnd0Data[Cnt] = *ptr++ ; ++Cnt;}
//          USBD->EP[0].MXPLD = Cnt;
//        }
//        break;
//      }
     else if(pSetUp[2] == 2){                              // 设备名
       gUsbCtrl.ReqLen = Minimum (gUsbCtrl.ReqLen, USB_ProductStringDesc[0]);
       ptr = (uint8_t*)USB_ProductStringDesc ;
       if(gUsbCtrl.ReqLen  >= USB_PACKET_SIZE_MAX){	
        do{pEnd0Data[Cnt]  = *ptr++ ;}while(++Cnt <= USB_PACKET_SIZE_MAX) ;
        USBD->EP[0].MXPLD  = USB_PACKET_SIZE_MAX;
        gUsbCtrl.pDesc     = (uint8_t *)USB_ConfigDescriptor + USB_PACKET_SIZE_MAX ;
        gUsbCtrl.ReqLen   -= USB_PACKET_SIZE_MAX;
        gUsbCtrl.StateFlag = FLAG_EP0_DATA_IN;
      }
      else{
        while(Cnt < gUsbCtrl.ReqLen){ pEnd0Data[Cnt] = *ptr++ ; ++Cnt;}
        USBD->EP[0].MXPLD = Cnt;
      }
       break;
     }
///	 	
  case DESC_HID_RPT:
    default:
      USBD->EP[0].CFGP |= 2 ;                              //功能不支持
      USBD->EP[1].CFGP |= 2 ;
      return ;
	}
    USBD->EP[1].MXPLD = 0;              //状态阶段准备, 这些都是IN事务, 先做状态阶段的OUT准备
	return ;
}

void EP3_Rx_Ready(void)
{
  USBD->EP[3].MXPLD = USB_PACKET_SIZE_MAX ;                //端点3 Rx准备接收下一包数据
  PRT_Flag |= PRINT_RECEIVING ;
}
//// 11种标准请求,这里只处理用到的几个,可简化代码 =======================================
void USB_StandardRequest(void)
{
  gUsbCtrl.StateFlag = 0 ;             //先假定函数结束后是状态阶段,且状态过后什么也不做

  switch (pSetUp[1]){                                      //请求描述符
    case GET_DESCRIPTOR:
      USB_GetDescriptor() ; 
      return  ;

