475241512/BT_Printer/资料/NUC123_USB_Printer_V1.01.00/NUC123_USB_Printer_V1.01.00/LIB_Source/Nuc123_usb_1.c
    case SET_ADDRESS:                                      //设定地址
      gUsbCtrl.StateFlag = FLAG_SET_ADDRESS;               //无数据阶段
      USBD->EP[0].CFG |= USB_CFG_DSQ_SYNC_DATA1 ;    
      USBD->EP[0].MXPLD = 0;                               //状态阶段准备
      return; 
 
    case SET_CONFIGURATION:                                //设定配置值
      gUsbCtrl.ConfigState = pSetUp[2] ;                   //保存配置值
      USBD->EP[2].MXPLD = 0;                               //端点2 Tx数据0个
      EP3_Rx_Ready() ;
      USBD->EP[0].CFG  |= USB_CFG_DSQ_SYNC_DATA1 ;   
      USBD->EP[0].MXPLD = 0 ;                              //状态阶段准备
      return ; 
 
//    case CLEAR_FEATURE:
//    case SET_FEATURE:
//      if((pSetUp[0] == 2) && (USB->RAM[2] == FEATURE_ENDPOINT_HALT)){
//        uint32_t u32CfgAddr;
//        uint32_t u32Cfg;
//        uint32_t i;
//
//        u32Cfg = pSetUp[4] & 0xF;
//        for (i = 0; i < gTotalEnpointCount+2; i++) {
//          if(gUsbCtrl.EPInfo[i] == u32Cfg){
//            u32Cfg = i;
//            break;
//          }
//        }
//        u32CfgAddr = (uint32_t)(u32Cfg << 4) + (uint32_t)0x40060028; /* USBD_CFG0 */
//        u32Cfg = *((__IO uint32_t *) (u32CfgAddr));
//
//        if(pSetUp[1] == CLEAR_FEATURE)  u32Cfg &= ~USB_CFG_SSTALL;
//        else  u32Cfg |= USB_CFG_SSTALL;
//        *((__IO uint32_t *) (u32CfgAddr)) = u32Cfg;
//      }
//      else  return ; 
//				
//      USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
//      USBD->MXPLD0 = 0;
//      return ; 
  
//    case GET_CONFIGURATION:
//      *ptr = gUsbCtrl.ConfigState ;                        //就发送一个字节:配置值
//      USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1 ;
//      USBD->MXPLD0  = 1 ;                                  //数据事务准备
//      USBD->MXPLD1  = 0 ;                                  //状态阶段准备
//      return ; 
 
//    case GET_STATUS : {
//      uint8_t u8Data;

//      u8Data = *(uint8_t *)(USBD_SRAM_BASE + USB->BUFSEG) ;
//      if(u8Data == 0x80){                                  //设备属性
//        if (USB_ConfigDescriptor[7] & 0x40) ptr[0] = 1;    // Self-Powered
//        else  ptr[0] = 0;                                  // bus-Powered
//      }
//      else if(u8Data == 0x81)  ptr[0] = 0 ;                //接口属性
//      else if (u8Data == 0x82){                            //端点属性
//        uint32_t u32CfgAddr;
//        uint32_t u32Cfg;
//        uint32_t i;
//
//        u32Cfg = (*(uint8_t *)(USBD_SRAM_BASE + USB->BUFSEG)+4) & 0xF;       //端点地址
//        for(i = 0; i < 5; i++){
//          if(gUsbCtrl.EPInfo[i] == u32Cfg){				//找到对应的端点地址
//            u32Cfg = i;
//            break;
//          }
//        }
//        u32CfgAddr = (uint32_t)(u32Cfg << 4) + (uint32_t)0x40060028; //找到该端点的配置寄存器
//        ptr[0] = *((__IO uint32_t *) (u32CfgAddr)) & USB_CFG_SSTALL? 1: 0 ;
//      }
//      else  return; 
//   			
//      ptr[1] = 0;
//      USBD->CFG0 |= USB_CFG_DSQ_SYNC_DATA1;
//      USBD->MXPLD0 = 2;
//      USBD->MXPLD1  = 0 ;                                  //状态阶段准备
//      return ;
//    }

//    case GET_INTERFACE:
//      USBD->EP[0].CFG |= USB_CFG_DSQ_SYNC_DATA1;
//      USBD->EP[0].MXPLD = 1 ;                              
//      USBD->EP[1].MXPLD = 0 ;                              
//      return ;

   case SET_INTERFACE:
          // Does interface need be stored ? 
     USBD->EP[0].CFG |= USB_CFG_DSQ_SYNC_DATA1 ;
     USBD->EP[0].MXPLD = 0;                               //状态阶段准备
     return ;

    default:
      USBD->EP[0].CFGP |= 2 ;                              //功能不支持
      USBD->EP[1].CFGP |= 2 ;
      return ;
  }
}
//// USB 数据收发中断处理, SETUP中断,或8个端点事件中断，调用各自的处理函数 ==============
void USB_UsbEvent(uint32_t u32INTSTS)
{
  if(u32INTSTS & USBD_INTF_SETUP){		   
    USBD->INTSTS = USBD_INTF_SETUP ;     
    switch(pSetUp[0] & 0x60){          //D[6,5]:0=Stardard,1=Class,2=Vendor,3=Reserved 
      case 0:                                              // 0x00, 11种标准请求
        USB_StandardRequest();          
        break;
      case 0x20:                                           // 0x20, 类请求
        USB_ClassRequest();
        break;
      case 0x40:                                           // 0x40, 厂商自定义请求
      default:                                             // 其它不支持, 回应STALL 		   
      USBD->EP[0].CFGP |= 2 ;                              //功能不支持
      USBD->EP[1].CFGP |= 2 ;
    }                      
  }
  else if(u32INTSTS & USBD_INTF_EP0){                      // Ctrl_In,端点地址: 0 
    USB_CtrlIn_Ack();
    USBD->INTSTS = USBD_INTF_EP0;
  }
  else if(u32INTSTS & USBD_INTF_EP1){		                   // Ctrl_Out, 端点地址: 0 	  
    USBD->INTSTS = USBD_INTF_EP1;
    USB_CtrlOut_Ack();
  }
  else if(u32INTSTS & USBD_INTF_EP2){	                     //Bulk_In, 端点地址: 1 
    USBD->INTSTS = USBD_INTF_EP2;
    USB_Tx_OVER() ;
  }
  else if(u32INTSTS & USBD_INTF_EP3){	
    USBD->INTSTS = USBD_INTF_EP3 ;                         //Bulk_Out, 端点地址: 2
    PRT_Flag    &= ~PRINT_RECEIVING ;
#ifdef PRINTER_USB_VCOM                                    
    USB_Rx_Data() ;                                        //处理收到的数据
    USBD->EP[3].MXPLD = USB_PACKET_SIZE_MAX ;              //端点3 Rx准备接收下一包数据
#else
    PTR_Data_Receive() ;                             // 是否接收下一包,在数据处理时判断
#endif    
  }
  else if(u32INTSTS & USBD_INTF_EP4){
    USBD->INTSTS = USBD_INTF_EP4;                          //中断 In , 端点地址: 3

  }	
  else if(u32INTSTS & USBD_INTF_EP5){
    USBD->INTSTS = USBD_INTF_EP5;	
  }	
  else if(u32INTSTS & USBD_INTF_EP6){
    USBD->INTSTS = USBD_INTF_EP6;	
  }	
  else if(u32INTSTS & USBD_INTF_EP7){
    USBD->INTSTS = USBD_INTF_EP7;	
  }	
  else{                                         		
    USBD->INTSTS = USBD_INTF_USB;
  }
}

//== USB 中断代码, 只有USB事件是调用函数, 另三个事件直接处理 ============================
//四个中断源: USB数据收发中断, 总线事件中断, 插拔中断, 唤醒中断. 
void USBD_IRQHandler(void)
{
  uint32_t u32INTSTS = USBD->INTSTS;

  if(u32INTSTS & USBD_INTSTS_USB_STS_Msk){                 //USB 数据收发中断
    USB_UsbEvent(u32INTSTS);                 
  }

  else if(u32INTSTS & USBD_INTSTS_BUS_STS_Msk){            //Bus中断
    if (USBD->ATTR & USBD_ATTR_RESUME_Msk){		             //总线恢复  
      USBD->ATTR  |=  USBD_ATTR_PHY_EN_Msk  ;                        
    }
    else if (USBD->ATTR & USBD_ATTR_SUSPEND_Msk){          //总线挂起 
      USBD->ATTR  &= ~USBD_ATTR_PHY_EN_Msk ;                               
    }
    else if (USBD->ATTR & USBD_ATTR_USBRST_Msk){           //总线复位
      USBD->ATTR |= USBD_ATTR_PHY_EN_Msk ; 		
      USBD->FADDR          = 0 ;	
      gUsbCtrl.ConfigState = 0 ;                  
      gUsbCtrl.StateFlag   = 0 ;
	  }
    USBD->INTSTS |= USBD_INTSTS_BUS_STS_Msk ; 	           //清中断标志
  }

  else if (u32INTSTS & USBD_INTSTS_FLDET_STS_Msk){         //插拔 中断
    USBD->INTSTS |= USBD_INTSTS_FLDET_STS_Msk ;	      
    USBD->ATTR = USBD_ATTR_BYTEM_Msk | USBD_ATTR_PWRDN_Msk | USBD_ATTR_DPPU_EN_Msk | USBD_ATTR_USB_EN_Msk ;   
  }

  else if (u32INTSTS & USBD_INTSTS_WAKEUP_STS_Msk){        //Wake up 中断
    USBD->INTSTS |= USBD_INTSTS_WAKEUP_STS_Msk;            //清标志位
  }
}

// 有Num个字符的字符串*ptr输出到USB虚拟串口 /////////////////////////////////////////////
void Send_to_VCOM(uint8_t *pStr, uint32_t Num)
{
  uint8_t *ptr = (uint8_t *)(USBD_BASE + 0x0100 + USBD->EP[2].BUFSEG) ;  //USB发送缓存

  Vcom_TxSize = Num ;                                      //发送字符个数
  while(Num--)  *ptr++ = *pStr++ ;                         //把待发送数据移到USB发送缓存
  USBD->EP[2].MXPLD = Vcom_TxSize ;                        //发送开始
}
